CF/InformationRegisters/ШаблоныРегистрацииНовыхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныРегистрацииНовыхКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроводитьОпросВладельцаПриРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВладельцаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлинаКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/InformationRegisters/ШаблоныРегистрацииНовыхКарт/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет на соответствие введенным шаблонам.
//
// Параметры:
//  КодКарты - числовой или строковый код карты.
//  ВидКарты - Перечисление ВидыИнформационныхКарт 
//  МассивШаблонов - массив возвращаемых шаблонов.
//
// Возвращаемое значение:
//  Булево
//
Функция РезультатПроверкиСоответствияШаблонам(КодКарты, ВидКарты, ТипШтрихкодаРТ, МассивШаблонов) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШаблоныКарт.ВидКарты,
	|	ШаблоныКарт.ПроводитьОпросВладельцаПриРегистрации,
	|	ШаблоныКарт.ДлинаКода,
	|	ШаблоныКарт.НачалоДиапазона КАК НачалоДиапазона,
	|	ШаблоныКарт.КонецДиапазона,
	|	ШаблоныКарт.ВидДисконтнойКарты,
	|	ШаблоныКарт.БонуснаяПрограммаЛояльности,
	|	ШаблоныКарт.ГруппаКарты,
	|	ШаблоныКарт.ГруппаВладельцаКарты,
	|	ШаблоныКарт.НаименованиеШаблона
	|ИЗ
	|	РегистрСведений.ШаблоныРегистрацииНовыхКарт КАК ШаблоныКарт
	|ГДЕ
	|	(ШаблоныКарт.ВидКарты = &ВидКарты
	|		ИЛИ ШаблоныКарт.ВидКарты = &СмешанныйВидКарты)
	|	И ШаблоныКарт.НачалоДиапазона <= &КодКарты
	|	И ШаблоныКарт.КонецДиапазона >= &КодКарты
	|	И ШаблоныКарт.ДлинаКода = &ДлинаКода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДиапазона");
	
	Запрос.УстановитьПараметр("ВидКарты", ВидКарты);
	Запрос.УстановитьПараметр("СмешанныйВидКарты", Перечисления.ВидыИнформационныхКарт.Смешанная);
	Запрос.УстановитьПараметр("КодКарты", Строка(КодКарты));
	Запрос.УстановитьПараметр("ДлинаКода", СтрДлина(Строка(КодКарты)));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе	
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПараметров = ОбщегоНазначенияРТ.СоздатьСтруктуруПоСтрокеВыборки(Результат, Выборка);
			СтруктураПараметров.Вставить("КодКарты", КодКарты);
			СтруктураПараметров.Вставить("ТипШтрихкода", ТипШтрихкодаРТ);
			МассивШаблонов.Добавить(СтруктураПараметров);
		КонецЦикла;
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
